cmsis-svd/cmsis-svd/data/Atmel/ATSAME70Q21B.svd
            <register>
               <name>PWM_ISR2</name>
               <description>PWM Interrupt Status Register 2</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WRDY</name>
                     <description>Write Ready for Synchronous Channels Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNRE</name>
                     <description>Synchronous Channels Update Underrun Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPM0</name>
                     <description>Comparison 0 Match</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPM1</name>
                     <description>Comparison 1 Match</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPM2</name>
                     <description>Comparison 2 Match</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPM3</name>
                     <description>Comparison 3 Match</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPM4</name>
                     <description>Comparison 4 Match</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPM5</name>
                     <description>Comparison 5 Match</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPM6</name>
                     <description>Comparison 6 Match</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPM7</name>
                     <description>Comparison 7 Match</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPU0</name>
                     <description>Comparison 0 Update</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPU1</name>
                     <description>Comparison 1 Update</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPU2</name>
                     <description>Comparison 2 Update</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPU3</name>
                     <description>Comparison 3 Update</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPU4</name>
                     <description>Comparison 4 Update</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPU5</name>
                     <description>Comparison 5 Update</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPU6</name>
                     <description>Comparison 6 Update</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPU7</name>
                     <description>Comparison 7 Update</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM_OOV</name>
               <description>PWM Output Override Value Register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OOVH0</name>
                     <description>Output Override Value for PWMH output of the channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOVH1</name>
                     <description>Output Override Value for PWMH output of the channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOVH2</name>
                     <description>Output Override Value for PWMH output of the channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOVH3</name>
                     <description>Output Override Value for PWMH output of the channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOVL0</name>
                     <description>Output Override Value for PWML output of the channel 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOVL1</name>
                     <description>Output Override Value for PWML output of the channel 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOVL2</name>
                     <description>Output Override Value for PWML output of the channel 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOVL3</name>
                     <description>Output Override Value for PWML output of the channel 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM_OS</name>
               <description>PWM Output Selection Register</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OSH0</name>
                     <description>Output Selection for PWMH output of the channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSH1</name>
                     <description>Output Selection for PWMH output of the channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSH2</name>
                     <description>Output Selection for PWMH output of the channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSH3</name>
                     <description>Output Selection for PWMH output of the channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSL0</name>
                     <description>Output Selection for PWML output of the channel 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSL1</name>
                     <description>Output Selection for PWML output of the channel 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSL2</name>
                     <description>Output Selection for PWML output of the channel 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSL3</name>
                     <description>Output Selection for PWML output of the channel 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM_OSS</name>
               <description>PWM Output Selection Set Register</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>OSSH0</name>
                     <description>Output Selection Set for PWMH output of the channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSH1</name>
                     <description>Output Selection Set for PWMH output of the channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSH2</name>
                     <description>Output Selection Set for PWMH output of the channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSH3</name>
                     <description>Output Selection Set for PWMH output of the channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSL0</name>
                     <description>Output Selection Set for PWML output of the channel 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSL1</name>
                     <description>Output Selection Set for PWML output of the channel 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSL2</name>
                     <description>Output Selection Set for PWML output of the channel 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSL3</name>
                     <description>Output Selection Set for PWML output of the channel 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM_OSC</name>
               <description>PWM Output Selection Clear Register</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>OSCH0</name>
                     <description>Output Selection Clear for PWMH output of the channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCH1</name>
                     <description>Output Selection Clear for PWMH output of the channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCH2</name>
                     <description>Output Selection Clear for PWMH output of the channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCH3</name>
                     <description>Output Selection Clear for PWMH output of the channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCL0</name>
                     <description>Output Selection Clear for PWML output of the channel 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCL1</name>
                     <description>Output Selection Clear for PWML output of the channel 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCL2</name>
                     <description>Output Selection Clear for PWML output of the channel 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCL3</name>
                     <description>Output Selection Clear for PWML output of the channel 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM_OSSUPD</name>
               <description>PWM Output Selection Set Update Register</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>OSSUPH0</name>
                     <description>Output Selection Set for PWMH output of the channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSUPH1</name>
                     <description>Output Selection Set for PWMH output of the channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSUPH2</name>
                     <description>Output Selection Set for PWMH output of the channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSUPH3</name>
                     <description>Output Selection Set for PWMH output of the channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSUPL0</name>
                     <description>Output Selection Set for PWML output of the channel 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSUPL1</name>
                     <description>Output Selection Set for PWML output of the channel 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSUPL2</name>
                     <description>Output Selection Set for PWML output of the channel 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSSUPL3</name>
                     <description>Output Selection Set for PWML output of the channel 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM_OSCUPD</name>
               <description>PWM Output Selection Clear Update Register</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>OSCUPH0</name>
                     <description>Output Selection Clear for PWMH output of the channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCUPH1</name>
                     <description>Output Selection Clear for PWMH output of the channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCUPH2</name>
                     <description>Output Selection Clear for PWMH output of the channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCUPH3</name>
                     <description>Output Selection Clear for PWMH output of the channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCUPL0</name>
                     <description>Output Selection Clear for PWML output of the channel 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCUPL1</name>
                     <description>Output Selection Clear for PWML output of the channel 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCUPL2</name>
                     <description>Output Selection Clear for PWML output of the channel 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCUPL3</name>
                     <description>Output Selection Clear for PWML output of the channel 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM_FMR</name>
               <description>PWM Fault Mode Register</description>
               <addressOffset>0x5C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FPOL</name>
                     <description>Fault Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FMOD</name>
                     <description>Fault Activation Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FFIL</name>
                     <description>Fault Filtering</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM_FSR</name>
               <description>PWM Fault Status Register</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FIV</name>
                     <description>Fault Input Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FS</name>
                     <description>Fault Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM_FCR</name>
               <description>PWM Fault Clear Register</description>
               <addressOffset>0x64</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>FCLR</name>
                     <description>Fault Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
